In [2]:
import pandas as pd
data = {
    "Name" : ["kim","James","Hoyoung"],
    "Region" : ["Seoul","Toronto","Vancouver"],
    "SW" : ["C", "Java", "Python"]
}
df = pd.DataFrame(data,index=["No.1", "No.2", "No.3"])

In [4]:
df

         Name     Region      SW
No.1      kim      Seoul       C
No.2    James    Toronto    Java
No.3  Hoyoung  Vancouver  Python

In [6]:
df.index

Index(['No.1', 'No.2', 'No.3'], dtype='object')

In [8]:
df.index.name = "No"
df

         Name     Region      SW
No
No.1      kim      Seoul       C
No.2    James    Toronto    Java
No.3  Hoyoung  Vancouver  Python

In [10]:
df.reset_index()

     No     Name     Region      SW
0  No.1      kim      Seoul       C
1  No.2    James    Toronto    Java
2  No.3  Hoyoung  Vancouver  Python

In [12]:
df.reset_index(drop=True)

      Name     Region      SW
0      kim      Seoul       C
1    James    Toronto    Java
2  Hoyoung  Vancouver  Python

In [16]:
df.reset_index(drop=True,inplace=True)
df

      Name     Region      SW
0      kim      Seoul       C
1    James    Toronto    Java
2  Hoyoung  Vancouver  Python

In [22]:
df.set_index("Name",inplace=True)

In [23]:
df

            Region      SW
Name
kim          Seoul       C
James      Toronto    Java
Hoyoung  Vancouver  Python

In [25]:
df

            Region      SW
Name
kim          Seoul       C
James      Toronto    Java
Hoyoung  Vancouver  Python

# Sort by index

In [31]:
df.sort_index(ascending = True)

            Region      SW
Name
Hoyoung  Vancouver  Python
James      Toronto    Java
kim          Seoul       C